module LessonsHelper

  def detailed_time(t)
  	if t >= 36000 && t%3600 >= 10
      "#{t/3600}時間#{t%3600/60}分"
    elsif t >= 36000 && t%3600 < 10
      "#{t/3600}時間0#{t%3600/60}分"
    elsif t < 35999 && t >= 3600 && t%3600 >= 10
      "0#{t/3600}時間#{t%3600/60}分"
    elsif t < 35999 && t >= 3600 && t%3600 < 10
      "0#{t/3600}時間0#{t%3600/60}分"
    elsif t < 3599 && t >= 360 && t%60 >= 10
      "#{t/60}分#{t%60}秒"
    elsif t < 3599 && t >= 360 && t%60 < 10
      "#{t/60}分0#{t%60}秒"
    elsif t < 360 && t >= 60 && t%60 >= 10
      "0#{t/60}分#{t%60}秒"
    elsif t < 360 && t >= 60 && t%60 < 10
      "0#{t/60}分0#{t%60}秒"
    elsif t <60 && t >= 10
      "#{t}秒"
    else
      "0#{t}秒"
    end
  end

end
